TestCase/axis_30/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];


internalField   uniform 1e+09;

boundaryField
{
    base
    {
        type            omegaWallFunction;
        blending        binomial2;
        n               2;
        beta1           0.075;
        value           uniform 1e+10;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 1e+09;
    }
    outlet
    {
        type            zeroGradient;
    }
    top
    {
        type            fixedValue;
        value           uniform 1e+09;
    }
    w1
    {
        type            wedge;
    }
    w2
    {
        type            wedge;
    }
}


// ************************************************************************* //
